NDJSec/FALCON/knowledge_base/svd/data/SiliconLabs/Series2/BGM22/BGM220SC22HNA.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>CRYPTOACC_NS_RNGCTRL</name>
      <version>1</version>
      <description>CRYPTOACC_NS_RNGCTRL Registers</description>
      <baseAddress>0x5C021000</baseAddress>
      <addressBlock>
        <offset>0x00000000</offset>
        <size>0x00001000</size>
        <usage>registers</usage>
      </addressBlock>
      <interrupt>
        <name>CRYPTOACC</name>
        <value>0</value>
      </interrupt>
      <interrupt>
        <name>TRNG</name>
        <value>1</value>
      </interrupt>
      <interrupt>
        <name>PKE</name>
        <value>2</value>
      </interrupt>
      <registers>
        <register>
          <name>RNGCTRL</name>
          <description>No Description</description>
          <addressOffset>0x000</addressOffset>
          <access>read-write</access>
          <resetValue>0x00040000</resetValue>
          <resetMask>0x001FFFFF</resetMask>
          <fields>
            <field>
              <name>ENABLE</name>
              <description>TRNG Module Enable</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>DISABLED</name>
                  <description>Module disabled</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ENABLED</name>
                  <description>Module enabled</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TESTEN</name>
              <description>Test Enable</description>
              <bitOffset>2</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NOISE</name>
                  <description>Non-determinsitc random number generation</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TESTDATA</name>
                  <description>Pseudo-random number generation</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>CONDBYPASS</name>
              <description>Conditioning Bypass</description>
              <bitOffset>3</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>The conditionig function is used</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>The conditioning function is bypassed</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REPCOUNTIEN</name>
              <description>IRQ enable for Repetition Count Test</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APT64IEN</name>
              <description>IRQ enable for APT64IF</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>APT4096IEN</name>
              <description>IRQ enable for APT4096IF</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FULLIEN</name>
              <description>IRQ enable for FIFO full</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>SOFTRESET</name>
              <description>Software Reset</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Module not in reset</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>The continuous test, the conditioning function and the FIFO are reset</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PREIEN</name>
              <description>IRQ enable for AIS31 prelim. noise alarm</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALMIEN</name>
              <description>IRQ enable for AIS31 noise alarm</description>
              <bitOffset>10</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FORCERUN</name>
              <description>Oscillator Force Run</description>
              <bitOffset>11</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>Oscillators will shut down when FIFO is full</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUN</name>
                  <description>Oscillators will continue to run even after FIFO is full</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPNIST</name>
              <description>NIST Start-up Test Bypass.</description>
              <bitOffset>12</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>NIST-800-90B startup test is applied. No data will be written to the FIFO until the test passes.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>NIST-800-90B startup test is bypassed.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>BYPAIS31</name>
              <description>AIS31 Start-up Test Bypass.</description>
              <bitOffset>13</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NORMAL</name>
                  <description>AIS31 startup test is applied. No data will be written to the FIFO until the test passes.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BYPASS</name>
                  <description>AIS31 startup test is bypassed.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>HEALTHTESTSEL</name>
              <description>Health test input select</description>
              <bitOffset>14</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BEFORE</name>
                  <description>Before conditioning</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFTER</name>
                  <description>After conditioning</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>AIS31TESTSEL</name>
              <description>AIS31 test input select</description>
              <bitOffset>15</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BEFORE</name>
                  <description>Before conditioning</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AFTER</name>
                  <description>After conditioning</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>NB128BITBLOCKS</name>
              <description>Number of 128b blocks in AES-CBCMAC</description>
              <bitOffset>16</bitOffset>
              <bitWidth>4</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>FIFOWRSTARTUP</name>
              <description>Fifo Write Start Up</description>
              <bitOffset>20</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOLEVEL</name>
          <description>Number of 32 bits words of random available in the FIFO. Writing to this register clears the FIFO full interrupt</description>
          <addressOffset>0x004</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIFOLEVEL</name>
              <description>FIFO Level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFOTHRESH</name>
          <description>FIFO level at which the rings are restarted when in the FIFOFull_Off state, expressed in number of 128bit blocks</description>
          <addressOffset>0x008</addressOffset>
          <access>read-only</access>
          <resetValue>0x0000003F</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIFOTHRESH</name>
              <description>FIFO threshold level</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>FIFODEPTH</name>
          <description>Maximum number of 32 bits words that can be stored in the FIFO: 2^g_fifodepth</description>
          <addressOffset>0x00C</addressOffset>
          <access>read-only</access>
          <resetValue>0x00000040</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>FIFODEPTH</name>
              <description>FIFO Depth.</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY0</name>
          <description>This set of registers bits form the 128-bit AES key used for conditioning function. The first byte (MSB of 128-bit word) is at address 0x0010, the second byte at address 0x0011...</description>
          <addressOffset>0x010</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY1</name>
          <description>This set of registers bits form the 128-bit AES key used for conditioning function. The first byte (MSB of 128-bit word) is at address 0x0010, the second byte at address 0x0011...</description>
          <addressOffset>0x014</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY2</name>
          <description>This set of registers bits form the 128-bit AES key used for conditioning function. The first byte (MSB of 128-bit word) is at address 0x0010, the second byte at address 0x0011...</description>
          <addressOffset>0x018</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>KEY3</name>
          <description>This set of registers bits form the 128-bit AES key used for conditioning function. The first byte (MSB of 128-bit word) is at address 0x0010, the second byte at address 0x0011...</description>
          <addressOffset>0x01C</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>KEY</name>
              <description>Key</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>TESTDATA</name>
          <description>This register is used to feed known data to the conditioning function or to the continuous tests.  See manual</description>
          <addressOffset>0x020</addressOffset>
          <access>write-only</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0xFFFFFFFF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Test data input to conditioning tests</description>
              <bitOffset>0</bitOffset>
              <bitWidth>32</bitWidth>
              <access>write-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>RNGSTATUS</name>
          <description>No Description</description>
          <addressOffset>0x030</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000007FF</resetMask>
          <fields>
            <field>
              <name>TESTDATABUSY</name>
              <description>Test Data Busy</description>
              <bitOffset>0</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>IDLE</name>
                  <description>TESTDATA write is finished processing or no test in progress.</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>BUSY</name>
                  <description>TESTDATA write is still being processed.</description>
                  <value>1</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>STATE</name>
              <description>State of the control FSM</description>
              <bitOffset>1</bitOffset>
              <bitWidth>3</bitWidth>
              <access>read-only</access>
              <enumeratedValues>
                <enumeratedValue>
                  <name>RESET</name>
                  <description>RESET State</description>
                  <value>0</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>STARTUP</name>
                  <description>STARTUP State</description>
                  <value>1</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFOFULLON</name>
                  <description>FIFOFULLON State</description>
                  <value>2</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>FIFOFULLOFF</name>
                  <description>FIFOFULLOFF State</description>
                  <value>3</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RUNNING</name>
                  <description>RUNNING State</description>
                  <value>4</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ERROR</name>
                  <description>ERROR State</description>
                  <value>5</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNUSED_6</name>
                  <description>UNUSED</description>
                  <value>6</value>
                </enumeratedValue>
                <enumeratedValue>
                  <name>UNUSED_7</name>
                  <description>UNUSED</description>
                  <value>7</value>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>REPCOUNTIF</name>
              <description>Repetition Count Test interrupt status</description>
              <bitOffset>4</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APT64IF</name>
              <description>64-sample window Adaptive Proportion IF</description>
              <bitOffset>5</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>APT4096IF</name>
              <description>4096-sample window Adaptive Prop. IF</description>
              <bitOffset>6</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>FULLIF</name>
              <description>FIFO full interrupt status</description>
              <bitOffset>7</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
            <field>
              <name>PREIF</name>
              <description>AIS31 Preliminary Noise Alarm IF</description>
              <bitOffset>8</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ALMIF</name>
              <description>AIS31 Noise Alarm interrupt status</description>
              <bitOffset>9</bitOffset>
              <bitWidth>1</bitWidth>
              <access>read-only</access>
            </field>
          </fields>
        </register>
        <register>
          <name>INITWAITVAL</name>
          <description>No Description</description>
          <addressOffset>0x034</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>INITWAITVAL</name>
              <description>Wait counter value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>SWOFFTMRVAL</name>
          <description>Number of clk cycles to wait before stopping the rings after the FIFO is full</description>
          <addressOffset>0x040</addressOffset>
          <access>read-write</access>
          <resetValue>0x0000FFFF</resetValue>
          <resetMask>0x0000FFFF</resetMask>
          <fields>
            <field>
              <name>SWOFFTMRVAL</name>
              <description>Switch Off Timer Value</description>
              <bitOffset>0</bitOffset>
              <bitWidth>16</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>CLKDIV</name>
          <description>Sample clock divider. The frequency at which the outputs of the rings are sampled is given by Fs = Fpclk/(ClkDiv + 1)</description>
          <addressOffset>0x044</addressOffset>
          <access>read-write</access>
          <resetValue>0x00000000</resetValue>
          <resetMask>0x000000FF</resetMask>
          <fields>
            <field>
              <name>VALUE</name>
              <description>Sample clock divider</description>
              <bitOffset>0</bitOffset>
              <bitWidth>8</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
        <register>
          <name>AIS31CONF0</name>
          <description>No Description</description>
          <addressOffset>0x048</addressOffset>
          <access>read-write</access>
          <resetValue>0x43401040</resetValue>
          <resetMask>0x7FFF7FFF</resetMask>
          <fields>
            <field>
              <name>STARTUPTHRES</name>
              <description>Start-up Threshold</description>
              <bitOffset>0</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
            <field>
              <name>ONLINETHRESH</name>
              <description>Online Threshold</description>
              <bitOffset>16</bitOffset>
              <bitWidth>15</bitWidth>
              <access>read-write</access>
            </field>
          </fields>
        </register>
